Table of Contents
 Class MemberHiddenClientFactory
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
public class MemberHiddenClientFactory : IMemberCalculatorFactory
Inheritance
object
MemberHiddenClientFactory
Implements
IMemberCalculatorFactory
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 MemberHiddenClientFactory(string)
public MemberHiddenClientFactory(string ideaInstallDir)
Parameters
ideaInstallDir string
Methods
 Create()
public MemberHiddenCheckClient Create()
Returns
MemberHiddenCheckClient
 Edit this page